src/Catalogs/Scan_МоделиПродуктов/Scan_МоделиПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_МоделиПродуктов</name>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаПродукта</name>
    <type>
      <types>CatalogRef.Scan_МаркиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТягачШасси</name>
    <type>
      <types>EnumRef.Scan_ПризнакТягачШасси</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_МоделиПродуктов/ObjectModule.bsl
Перем НаименованиеДоИзменения; //rarus vikhle 04.09.2020 mt 16181

//rarus tenkam 14.06.2016 mantis 7068 ++
Процедура ПередЗаписью(Отказ)
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	
	//rarus tenkam 13.03.2017 mantis 7177 +++
	Если МаркаПродукта = Справочники.Scan_МаркиПродуктов.Scania Тогда
		Если НЕ ЗначениеЗаполнено(КолеснаяФормула) Тогда
			КолеснаяФормула = Scan_ВспомогательныеФункцииСервер.ПолучитьКолеснуюФормулу(Наименование);
		КонецЕсли;
		// rarus tenkam 17.08.2020 mantis 16422 +++
		Если НЕ ЗначениеЗаполнено(ТягачШасси) Тогда
			ТягачШасси = Справочники.Scan_МоделиПродуктов.ПолучитьПризнакТягачШасси(Наименование);	
		КонецЕсли;	
		// rarus tenkam 17.08.2020 mantis 16422 ---
	КонецЕсли;
	//rarus tenkam 13.03.2017 mantis 7177 ---
	
	//rarus bonmak 18.12.2019 15285 ++
	//было
	//ОтборСтруктура = Новый Структура("Наименование", Наименование);			
	//Выборка = Справочники.Scan_МоделиПродуктов.Выбрать(,,ОтборСтруктура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МоделиПродуктов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_МоделиПродуктов КАК Scan_МоделиПродуктов
		|ГДЕ
		|	Scan_МоделиПродуктов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	//rarus bonmak 18.12.2019 15285 --
		
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = Ссылка Тогда
			Продолжить;
		КонецЕсли;
		//rarus bonmak 18.12.2019 15285 ++
		//rarus bonmak 18.12.2019 15285 --
		Сообщение = Новый СообщениеПользователю;
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Модель " + Наименование + " уже существует!";
		Сообщение.Текст = НСтр("ru = 'Модель '; en = 'Model '") + Наименование + НСтр("ru = ' уже существует!'; en = ' already exists!'");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Сообщить();
		ЗаписьЖурналаРегистрации("Ошибка справочника", УровеньЖурналаРегистрации.Ошибка,, Ссылка, Сообщение.Текст); //rarus bonmak 20.12.2019 15531

		Отказ = Истина;
		Возврат;	//rarus tenkam 22.06.2016 mantis 7042 +
	КонецЦикла;
	НаименованиеДоИзменения = Ссылка.Наименование;//rarus vikhle 04.09.2020 mt 16181;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//rarus vikhle 04.09.2020 mt 16181 +++
	Если НЕ ЭтоНовый() И НЕ Наименование = НаименованиеДоИзменения Тогда
		Справочники.Scan_ДрафтыПродуктов.ОбновитьНаименованиеДрафта(Ссылка);
	КонецЕсли;
	//rarus vikhle 04.09.2020 mt 16181 ---
КонецПроцедуры
//rarus tenkam 14.06.2016 mantis 7068 --
